# ErrorResolved Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..ErrorResolved Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Error "[Text]" was automatically resolved by "[Resolution]"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ErrorResolved { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ErrorResolved As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ErrorResolved {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace